# Tasks

####
1. Create a DataFrame by your own with Name, Marks and Gender
2. Show First 3 Records
3. Show Last 3 Records
4. Show Number of Rows and Columns
5. Show Datatype of the Fields
6. Check for Null Values
7. Find the count of Male and Female Candidates from dataset
8. Find Average Marks scored by the Candidates
9. Find total number of Candidates who scored marks between 70 and 90 (including it)
10. Create one column using apply() function
11. Drop a column
12. Encode on Gender using map() function
13. Sort the data according to Marks
14. Display Name and Marks of all the Female Candidates
15. Use sklearn to Encode Gender column

#### --------------------------------------------

##### Q1

In [2]:
import pandas as pd

In [4]:
dict1 = {'Name': ['Rohit','Neha','Sohan','Naina','Vivan','Parag'],
        'Marks': [85,62,90,43,62,94],
        'Gender': ['M','F','M','F','M','M']}
df1= pd.DataFrame(dict1)
df1

    Name  Marks Gender
0  Rohit     85      M
1   Neha     62      F
2  Sohan     90      M
3  Naina     43      F
4  Vivan     62      M
5  Parag     94      M

##### Q2

In [6]:
df1.head(3)

    Name  Marks Gender
0  Rohit     85      M
1   Neha     62      F
2  Sohan     90      M

##### Q3

In [7]:
df1.tail(3)

    Name  Marks Gender
3  Naina     43      F
4  Vivan     62      M
5  Parag     94      M

##### Q4

In [9]:
df1.shape

(6, 3)

In [10]:
print('Number of rows:',df1.shape[0])
print('Number of columns:',df1.shape[1])

Number of rows: 6
Number of columns: 3

##### Q5

In [11]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    6 non-null      object
 1   Marks   6 non-null      int64
 2   Gender  6 non-null      object
dtypes: int64(1), object(2)
memory usage: 276.0+ bytes

##### Q6

In [15]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

In [18]:
df1.describe(include='all')

         Name      Marks Gender
count       6   6.000000      6
unique      6        NaN      2
top     Rohit        NaN      M
freq        1        NaN      4
mean      NaN  72.666667    NaN
std       NaN  20.076520    NaN
min       NaN  43.000000    NaN
25%       NaN  62.000000    NaN
50%       NaN  73.500000    NaN
75%       NaN  88.750000    NaN
max       NaN  94.000000    NaN

##### Q7

In [20]:
print(df1['Gender'].unique())

['M' 'F']

In [23]:
df1['Gender'].nunique()

2

In [24]:
df1['Gender'].value_counts()

Gender
M    4
F    2
Name: count, dtype: int64

##### Q8

In [27]:
df1[df1['Marks']>=70]

    Name  Marks Gender
0  Rohit     85      M
2  Sohan     90      M
5  Parag     94      M

In [30]:
df1[df1['Marks'].between(70,90)]

    Name  Marks Gender
0  Rohit     85      M
2  Sohan     90      M

In [35]:
len(df1[(df1['Marks']>=70) & (df1['Marks']<=90)])    #Alternate way

2

In [37]:
len(df1[df1['Marks'].between(70,90)])

2

##### Q9

In [43]:
print(round(df1['Marks'].mean(),0))

73.0

##### Q10

In [52]:
#apply function
df1['Half'] = df1['Marks'].apply(lambda x: x/2)

In [53]:
df1

    Name  Marks Gender  Half  Percentage
0  Rohit     85      M  42.5        42.5
1   Neha     62      F  31.0        31.0
2  Sohan     90      M  45.0        45.0
3  Naina     43      F  21.5        21.5
4  Vivan     62      M  31.0        31.0
5  Parag     94      M  47.0        47.0

##### Q11

In [59]:
df1.drop(columns='Percentage', inplace=True)

##### Q12

In [57]:
#encoding on gender using map()
df1['Gender'] = df1['Gender'].map({'M':1, 'F':0})

In [60]:
df1

    Name  Marks  Gender  Half
0  Rohit     85       1  42.5
1   Neha     62       0  31.0
2  Sohan     90       1  45.0
3  Naina     43       0  21.5
4  Vivan     62       1  31.0
5  Parag     94       1  47.0

In [61]:
df1.columns

Index(['Name', 'Marks', 'Gender', 'Half'], dtype='object')

In [62]:
df1.index

RangeIndex(start=0, stop=6, step=1)

##### Q13

In [65]:
df1.sort_values(by='Marks', ascending=False)

    Name  Marks  Gender  Half
5  Parag     94       1  47.0
2  Sohan     90       1  45.0
0  Rohit     85       1  42.5
1   Neha     62       0  31.0
4  Vivan     62       1  31.0
3  Naina     43       0  21.5

In [73]:
df1.sort_values(by=['Marks','Gender'], ascending=False)

    Name  Marks Gender  Half
5  Parag     94      M  47.0
2  Sohan     90      M  45.0
0  Rohit     85      M  42.5
4  Vivan     62      M  31.0
1   Neha     62      F  31.0
3  Naina     43      F  21.5

In [71]:
df1['Gender'] = df1["Gender"].map({1:'M',0:'F'})

In [72]:
df1

    Name  Marks Gender  Half
0  Rohit     85      M  42.5
1   Neha     62      F  31.0
2  Sohan     90      M  45.0
3  Naina     43      F  21.5
4  Vivan     62      M  31.0
5  Parag     94      M  47.0

##### Q14

In [79]:
df1[df1['Gender']=='F'] [['Name','Marks']]  #2d list

    Name  Marks
1   Neha     62
3  Naina     43

In [80]:
df1

    Name  Marks Gender  Half
0  Rohit     85      M  42.5
1   Neha     62      F  31.0
2  Sohan     90      M  45.0
3  Naina     43      F  21.5
4  Vivan     62      M  31.0
5  Parag     94      M  47.0

##### Q15

In [81]:
from sklearn.preprocessing import OneHotEncoder

In [84]:
ohe = OneHotEncoder(drop='first')
arr = ohe.fit_transform(df1[['Gender']]).toarray()
df1[['Gender']] = pd.DataFrame(arr, columns=['Gender'])

In [85]:
df1

    Name  Marks  Gender  Half
0  Rohit     85     1.0  42.5
1   Neha     62     0.0  31.0
2  Sohan     90     1.0  45.0
3  Naina     43     0.0  21.5
4  Vivan     62     1.0  31.0
5  Parag     94     1.0  47.0